# IFCProperty Mapping Info Class

Source: https://www.revitapidocs.com/2026/dc749207-a8f4-9e72-b7ea-e6aa157bb712.htm

---

| IFCProperty Mapping Info Class |
| --- |

Represents the IFC property mapping information stored in the template. Inheritance Hierarchy System Object
Autodesk.Revit.DB IFCPropertyMappingInfo

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class IFCPropertyMappingInfo : IDisposable
```

```
Public Class IFCPropertyMappingInfo
	Implements IDisposable
```

```
public ref class IFCPropertyMappingInfo : IDisposable
```

```
type IFCPropertyMappingInfo =
    class
        interface IDisposable
    end
```
The IFCPropertyMappingInfo type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | IFCPropertyMappingInfo | Constructs a new IFCPropertyMappingInfo with default values. |
|  | IFCPropertyMappingInfo(Boolean, String, ElementId, String) | Constructs a new IFCPropertyMappingInfo with input values.  The flag that indicates whether the property is included in export.  The property name.  The Revit property id.  The Revit property id. |

Top Properties

|  | Name | Description |
| --- | --- | --- |
|  | ExportFlag | Whether or not the property is included in export. |
|  | IFCPropertyName | The IFC property name. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | RevitPropertyId | The Revit property id. |
|  | RevitPropertyName | The Revit property name. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCPropertyMappingInfo |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | IsValidMappingInfo | Defines whether the mapping info contains meaningful data. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace